//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
int a;
a = 11;
if (a%2 == 0)
{
    System.Console.WriteLine("Чётное.");
}
else
{
    System.Console.WriteLine("Нечётное.");
}