//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

int i, N;
i = 0;
N = 12;
while (i < N-1) 
{
    Console.WriteLine(i += 2);
}