//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int a,b;
a = 45;
b = 86;
if (a > b)
{
    System.Console.WriteLine($"Число {a} больше, чем {b}.");
}
else
{
    System.Console.WriteLine($"Число {b} больше, чем {a}.");
}
